acceptance_texts = {
    1: """Роль: 

你好!
Отбор был серьёзным испытанием. Мы внимательно изучили сотни решений, и твоё оказалось одним из самых сильных. Добро пожаловать в команду КБК!

Это то место, где все твои идеи находят живой отклик, а знакомства согревают своим теплом. Присоединяйся к чату команды — там уже собираются участники и руководители направлений, начинается обсуждение идей и подготовка к форуму.

🔗 https://t.me/+4hq650-lHiU0ZDAy 

Общайся с будущими "друлегами" и заряжайся вдохновением :)

Да-да, КБК начинается прямо сейчас!
""",
    2: """Роль: 

你好!
Отбор был серьёзным испытанием. Мы внимательно изучили сотни решений, и твоё оказалось одним из самых сильных. Добро пожаловать в команду КБК!

Это то место, где все твои идеи находят живой отклик, а знакомства согревают своим теплом. Присоединяйся к чату команды — там уже собираются участники и руководители направлений, начинается обсуждение идей и подготовка к форуму.

🔗 https://t.me/+3MNzPMHDgAc0ZDY6 

Общайся с будущими "друлегами" и заряжайся вдохновением :)

Да-да, КБК начинается прямо сейчас!
""",
    3: """Роль: 

你好!
Отбор был серьёзным испытанием. Мы внимательно изучили сотни решений, и твоё оказалось одним из самых сильных. Добро пожаловать в команду КБК!

Это то место, где все твои идеи находят живой отклик, а знакомства согревают своим теплом. Присоединяйся к чату команды — там уже собираются участники и руководители направлений, начинается обсуждение идей и подготовка к форуму.

🔗 https://t.me/+wJb-z446vNc2Mjli 

Общайся с будущими "друлегами" и заряжайся вдохновением :)

Да-да, КБК начинается прямо сейчас!
""",
    4: """Роль: (вставить отдел и роль человека) (пример, Отдел по работе с партнёрами, event-менеджер)

你好!
Отбор был серьёзным испытанием. Мы внимательно изучили сотни решений, и твоё оказалось одним из самых сильных. Добро пожаловать в команду КБК!

Это то место, где все твои идеи находят живой отклик, а знакомства согревают своим теплом. Присоединяйся к чату команды — там уже собираются участники и руководители направлений, начинается обсуждение идей и подготовка к форуму.

🔗 https://t.me/+Ey5o6Jph99pmMGRi 

Общайся с будущими "друлегами" и заряжайся вдохновением :)

Да-да, КБК начинается прямо сейчас!
""",
    5: """Роль: 

你好!
Отбор был серьёзным испытанием. Мы внимательно изучили сотни решений, и твоё оказалось одним из самых сильных. Добро пожаловать в команду КБК!

Это то место, где все твои идеи находят живой отклик, а знакомства согревают своим теплом. Присоединяйся к чату команды — там уже собираются участники и руководители направлений, начинается обсуждение идей и подготовка к форуму.

🔗 https://t.me/+Cvn-ILkZedoyOGMy 

Общайся с будущими "друлегами" и заряжайся вдохновением :)

Да-да, КБК начинается прямо сейчас!
""",
    6: """Роль: 

你好!
Отбор был серьёзным испытанием. Мы внимательно изучили сотни решений, и твоё оказалось одним из самых сильных. Добро пожаловать в команду КБК!

Это то место, где все твои идеи находят живой отклик, а знакомства согревают своим теплом. Присоединяйся к чату команды — там уже собираются участники и руководители направлений, начинается обсуждение идей и подготовка к форуму.

🔗 https://t.me/+9jXEiamQUP42ZGJi 

Общайся с будущими "друлегами" и заряжайся вдохновением :)
""",
    7: """Роль: 

你好!
Отбор был серьёзным испытанием. Мы внимательно изучили сотни решений, и твоё оказалось одним из самых сильных. Добро пожаловать в команду КБК!

Это то место, где все твои идеи находят живой отклик, а знакомства согревают своим теплом. Присоединяйся к чату команды — там уже собираются участники и руководители направлений, начинается обсуждение идей и подготовка к форуму.

🔗 https://t.me/+GqvuJ_HtlZMxOWQy 

Общайся с будущими "друлегами" и заряжайся вдохновением :)

Да-да, КБК начинается прямо сейчас!
""",
}

decline_text = """大家好!
Мы внимательно изучили сотни тестовых заданий. Конкуренция была действительно высокой, и на этот раз твоё решение не вошло в список финалистов. Это не поражение — это часть пути. Каждый отбор показывает, куда расти дальше, и даёт шанс увидеть себя с новой стороны!

Мы подготовили персональную обратную связь: руководители направлений отметили сильные стороны твоего решения и подсказали, что можно улучшить. Запросить её можно прямо в личном кабинете — она поможет сделать следующий шаг осознанно и уверенно.

Мы искренне верим, что впереди будет ещё много моментов, где твой потенциал проявится в полной мере.
КБК — это не разовый шанс, а большое движение. И мы будем рады видеть тебя снова!
"""