[
  {
    "datetime": "2025-08-31T16:00:00+03:00",
    "text": "<b>Лето кончается. А твой шанс попасть в команду КБК – еще впереди!</b>\n\nНе забудь заполнить анкету до конца и отправить ее до 19 сентября. Обрати внимание: если ты уже дошёл до резюме, но не смог его сразу отправить, то заявку нужно будет заполнить заново через /menu.\nЕсть вопросы по работе бота? Напиши @zobko в телеграм. Мы всегда готовы помочь!",
    "groups": ["not_submitted"]
  },
  {
    "datetime": "2025-08-31T16:00:00+03:00",
    "text": "Привет. Спасибо за доверие и интерес к нашему проекту! Наберись терпения: обработка заявок займёт некоторое время. Обязательно напишем тебе по итогам отбора. Обещаем!\n\n<b>Остаёмся на связи</b> 🤝",
    "groups": ["submitted"]
  },
  {
    "datetime": "2025-09-03T16:00:00+03:00",
    "text": "<b>Первая неделя учёбы — лучшее время для новых свершений</b> 🏆\n\nКниги куплены, а энтузиазма хоть отбавляй? Отлично! Самое время добавить в расписание что-то действительно крутое! \n\nНапоминаем, что отбор в команду КБК стартовал еще 25 августа, но именно сейчас — идеальный момент, чтобы присоединиться.\n\n<i>Успей подать заявку, пока все только раскачиваются!</i>",
    "groups": ["not_submitted"]
  },
  {
    "datetime": "2025-09-03T16:00:00+03:00",
    "text": "<b>Вы в числе первых, кто подал заявку в команду КБК</b> — а мы знаем, что первые кандидаты обычно самые мотивированные и крутые. Мы ценим серьезный настрой! \n\nПосле 19 сентября мы объявим результаты первого этапа отбора. Не сбавляй обороты: рвение приведет тебя к успеху 🔥",
    "groups": ["submitted"]
  },
  {
    "datetime": "2025-09-09T16:00:00+03:00",
    "text": "<b>Команда КБК продолжает расти, благодаря таким целеустремленным людям, как ты</b> 💫\n\nМы уже вовсю изучаем присланные анкеты. Это чувство, когда вокруг собираются единомышленники — бесценно. Готовься к интенсивному погружению в китайский бизнес, крутые знакомства и реальные проекты. До старта осталось совсем чуть-чуть!",
    "groups": ["submitted"]
  },
  {
    "datetime": "2025-09-09T16:00:00+03:00",
    "text": "<b>Ты из тех, кто любит откладывать важные дела на потом, и забывает про них? Это напоминание специально для тебя</b> ⏰\n\nСкорее всего, ты видел посты в соцсетях и думал: \"надо бы подать заявку\", но потом отложил и забыл. Исправь это прямо сейчас, ведь отбор заканчивается совсем скоро. Все, что нужно — твой решительный шаг. Регистрируйся, пока время не вышло!",
    "groups": ["not_submitted"]
  },
  {
    "datetime": "2025-09-18T16:00:00+03:00",
    "text": "<b>Финишная прямая! До конца приёма заявок остались считанные часы...</b>\n\nЭто значит, что совсем скоро мы объявим долгожданные результаты отбора! Следи за сообщениями. Официальные приглашения на следующий этап будут разосланы до 22 сентября. Скоро увидимся :)",
    "groups": ["submitted"]
  },
  {
    "datetime": "2025-09-18T16:00:00+03:00",
    "text": "<b>Нет времени ждать: отбор в команду КБК завершается уже завтра</b>\n\nЖдал особого знака, чтобы подать заявку? Вот он! Скорее заполняй форму и присоединяйся к команде профессионалов своего дела.\n\nНе упусти шанс изменить свое будущее!",
    "groups": ["not_submitted"]
  },
  {
    "datetime": "2025-09-22T12:20:00+03:00",
    "text": "<b>大家好!</b>\nОтбор был настоящей проверкой на прочность: мы рассмотрели более 300 заявок, и твоя вошла в число лучших. Переходи в раздел Тестовоые задания, чтобы увидеть список утвержденных приоритетов и приступить к тестовым заданиям. Выбирай направление (или несколько) и продемонстрируй в работе свой креатив, уверенность и внимание к деталям. \n\nНе откладывай решение на последний момент. Рекомендуем выполнить задания заранее. Несмотря на то, что их немного, именно по ним мы оцениваем глубину мышления и твой профессиональный потенциал. В случае успешного прохождения на третий этап с тобой свяжется руководитель выбранного направления и пригласит на интервью.\n\nЕсли появятся вопросы или что-то пойдёт не так, пиши в техподдержку, мы всегда рядом и готовы помочь!",
    "groups": ["accepted"]
  },
  {
    "datetime": "2025-09-22T12:20:00+03:00",
    "text": "<b>大家好!</b>\n\nМы внимательно изучили более 300 заявок. Конкуренция была очень высокой, и к сожалению, на этот раз твой путь в рамках основного отбора на этом завершается. Это не приговор, это – точка роста, от которой можно (и нужно!) двигаться дальше. Мы будем рады видеть тебя на других активностях КБК’26.\n\nМы верим в твой потенциал и хотим, чтобы ты продолжал раскрывать себя. В следующих заявках попробуй подробнее делиться тем, что для тебя действительно важно: опытом, мыслями, идеями, тем, что тебя вдохновляет. Позволь нам увидеть за строчками анкеты живого человека: твой характер, ценности и амбиции.\nУверены, впереди ещё много пересечений и возможностей, где твоя уникальность сможет проявиться в полной мере.\n\nНикогда не останавливайся и смело двигайся вперёд, и мы уверены, что наши пути ещё обязательно пересекутся!",
    "groups": ["not_accepted"]
  },
  {
    "datetime": "2025-09-28T18:35:00+03:00",
    "text": "<b>Обновление дедлайна</b> 🙌🏻\n\n大家好! Мы заметили, как многие из вас энергично работают над заданиями, боясь не успеть закончить работу вовремя. Мы ценим каждую креативную идею, поэтому переносим дедлайн, чтобы все смогли справиться с заданиями без спешки и стресса. \n\nБольшое спасибо всем тем, кто уже отправил работу! Ваши работы приняты и ждут проверки. У остальных ребят еще есть время до <u><b>23:59 2 октября</b></u>. \n\nВся актуальная информация об отборе будет приходить через этого бота — советуем не отключать уведомления, чтобы ничего не пропустить 🔔\n\nУдачи, мы в тебя верим!",
    "groups": ["accepted"]
  }
]
